{
  "_name_or_path": "facebook/opt-iml-max-30b",
  "_remove_final_layer_norm": false,
  "activation_function": "relu",
  "architectures": [
    "OPTForCausalLM"
  ],
  "attention_dropout": 0.0,
  "bos_token_id": 2,
  "do_layer_norm_before": true,
  "dropout": 0.1,
  "enable_bias": true,
  "eos_token_id": 2,
  "ffn_dim": 28672,
  "hidden_size": 7168,
  "init_std": 0.02,
  "layer_norm_elementwise_affine": true,
  "layerdrop": 0.0,
  "max_position_embeddings": 2048,
  "model_type": "opt",
  "num_attention_heads": 56,
  "num_hidden_layers": 48,
  "pad_token_id": 1,
  "torch_dtype": "float32",
  "transformers_version": "4.27.0.dev0",
  "use_cache": true,
  "vocab_size": 50272,
  "word_embed_proj_dim": 7168
}
